# Pandas for Data Processing

## GOTO Slides: Course Overview

# Lesson 1: 

## GOTO Slide: Exploring data

- Load data from file
- DataFrames
- view data

## GOTO Slide: DataFrame

## GOTO Slide: Exploring the DataFrame

### Load data from file

Learning Objectives
- import pandas
- read_csv()

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('SalaryDatabase_small.csv')

### View data

Learning Objectives:
* df.head(), df.tail(), df.columns(), 
* view subset of rows based on row index
* df.describe(), df.info(), df.shape
* select a subset of columns: df['col1','col2']
* df.sort_values()
* select subset of rows based on a condition: df.query()

In [3]:
df.head(6)

,Title,Location,ds(1)_or_ml,Seniority,Region,Salary
0,Machine Learning Engineer,"San Francisco, California, United States",0,2,1,138483
1,"Senior Manager, Machine Learning Engineering","Santa Clara, California",0,4,2,172296
2,Senior Machine Learning Engineer,"Sunnyvale, California, United States",0,4,2,237781
3,Machine Learning Engineer,"San Diego, California, United States",0,2,4,120817
4,"Machine Learning Engineer, Data Science","San Francisco, California",0,3,1,165232
5,Machine Learning Engineer,"Fountain Valley, California, United States",0,3,3,152646

In [4]:
df.tail(7)

,Title,Location,ds(1)_or_ml,Seniority,Region,Salary
13,Associate Data Scientist,"Fullerton, California, United States",1,2,3,126978
14,Data Scientist,"Sunnyvale, California, United States",1,3,2,114917
15,Co-Founder & Chief Data Scientist,"San Francisco, CA",1,4,1,210265
16,Data Scientist,"Fremont, California",1,3,2,111988
17,Data Scientist,"Menlo Park, California, United States",1,2,2,189417
18,Data Scientist (Tech lead),Greater Los Angeles Area,1,3,3,136363
19,Data Scientist,San Jose,1,3,2,189340

In [ ]:
df.shape # It's an attribute, not a function, no ()

In [5]:
df.describe()

       ds(1)_or_ml  Seniority     Region         Salary
count    20.000000  20.000000  20.000000      20.000000
mean      0.500000   2.700000   1.950000  157859.300000
std       0.512989   0.732695   0.825578   40521.272503
min       0.000000   2.000000   1.000000  106294.000000
25%       0.000000   2.000000   1.000000  119342.000000
50%       0.500000   3.000000   2.000000  158939.000000
75%       1.000000   3.000000   2.000000  189359.250000
max       1.000000   4.000000   4.000000  237781.000000

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Title        20 non-null     object
 1   Location     20 non-null     object
 2   ds(1)_or_ml  20 non-null     int64
 3   Seniority    20 non-null     int64
 4   Region       20 non-null     int64
 5   Salary       20 non-null     int64
dtypes: int64(4), object(2)
memory usage: 1.1+ KB

In [9]:
df.columns # It's an attribute, not a function, no ()

Index(['Title', 'Location', 'ds(1)_or_ml', 'Seniority', 'Region', 'Salary'], dtype='object')

select a subset of columns
- The inner brackets represent a Python list
- the outer brackets are pandas notation for accessing the dataframe

In [156]:
df[ ['Title','Salary'] ]

    Salary
0   138483
1   172296
2   237781
3   120817
4   165232
5   152646
6   210640
7   179940
8   172080
9   106294
10  110393
11  109409
12  201907
13  126978
14  114917
15  210265
16  111988
17  189417
18  136363
19  189340

In [158]:
df.sample(5, random_state=0)

,Title,Location,ds(1)_or_ml,Seniority,Region,Salary
18,Data Scientist (Tech lead),Greater Los Angeles Area,1,3,3,136363
1,"Senior Manager, Machine Learning Engineering","Santa Clara, California",0,4,2,172296
19,Data Scientist,San Jose,1,3,2,189340
8,Senior Machine Learning Research Engineer,"Mountain View, California",0,2,2,172080
10,Senior Data Scientist/Machine Learning Researcher,"San Francisco, CA",1,2,1,110393

## GOTO Slide: Selecting columns